Функция ПроверкаБанковскихРеквизитов(СтруктураКолонок, ТабДок) Экспорт
	
	СписокОшибок = Новый Массив;
	
	//Создаем записи с этапом проверки  в регистре
	МенеджерЗаписи = РегистрыСведений.ADR_EXT_ЭтапыПроверки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЭтапПроверки = Перечисления.ADR_EXT_ЭтапыПроверок.ПроверкаРеквизитов;
	МенеджерЗаписи.ДатаПроверки = ТекущаяДата();
	МенеджерЗаписи.Статус = Перечисления.ADR_EXT_СатусыЭтаповПроверки.ВПроцессе;
	МенеджерЗаписи.Записать();
	
		
	Для НомерСтроки = СтруктураКолонок.СтрокаЗаголовков + 1 по ТабДок.ВысотаТаблицы - 1 Цикл
		
		//Получаем все значения реквизитов из строки на каждой итерации
		ТекстЯчейкиФормаОплаты = СокрЛП(ТабДок.Область(НомерСтроки, СтруктураКолонок.ФормаОплаты).Текст);
		ТекстЯчейкиИНН = СокрЛП(ТабДок.Область(НомерСтроки, СтруктураКолонок.ИНН).Текст);
		ТекстЯчейкиРасчетныйСчет = СокрЛП(ТабДок.Область(НомерСтроки, СтруктураКолонок.РасчетныйСчет).Текст);
		ТекстЯчейкиБИК = СокрЛП(ТабДок.Область(НомерСтроки, СтруктураКолонок.БИК).Текст);
		ТекстЯчейкиКарта = СокрЛП(ТабДок.Область(НомерСтроки, СтруктураКолонок.Карта).Текст);
		ТекстЯчейкиДатаРождения = СокрЛП(ТабДок.Область(НомерСтроки, СтруктураКолонок.ДатаРождения).Текст);
		
		
		Если ТекстЯчейкиФормаОплаты = "" Тогда
			СписокОшибок.Добавить("В строке" + " " + НомерСтроки  + " " + "Не указана форма оплаты!");
		ИначеЕсли ТекстЯчейкиФормаОплаты = "Нал" Тогда
			
			Если ТекстЯчейкиБИК = "" Тогда
				СписокОшибок.Добавить("В строке" + " " + НомерСтроки  + " " + "Не указан БИК!");
			ИначеЕсли СтрДлина(ТекстЯчейкиБИК) <> 9 Тогда
				СписокОшибок.Добавить("Проверьте номер БИК в строке " + НомерСтроки);	
			КонецЕсли;
			
			Если ТекстЯчейкиКарта = "" Тогда
				СписокОшибок.Добавить("В строке" + " " + НомерСтроки  + " " + "Не указан номер карты!");
			ИначеЕсли СтрДлина(ТекстЯчейкиКарта) <> 16 Тогда
				СписокОшибок.Добавить("Некорректный номер банковской карты в строке " + НомерСтроки);
			КонецЕсли;
			
			Если ТекстЯчейкиРасчетныйСчет = "" Тогда
				СписокОшибок.Добавить("В строке" + " " + НомерСтроки  + " " + "Не указан номер расчетного счета!");
			ИначеЕсли (Лев(ТекстЯчейкиРасчетныйСчет, 4) <> "4081" И 
				Лев(ТекстЯчейкиРасчетныйСчет, 4) <> "4082") ИЛИ СтрДлина(ТекстЯчейкиРасчетныйСчет) <> 20 Тогда
				СписокОшибок.Добавить("Некорректный номер расчетного счета в строке " + НомерСтроки);
			КонецЕсли;
			
			Если Лев(ТекстЯчейкиРасчетныйСчет, 4) = "4081" И (ТекстЯчейкиИНН = "" ИЛИ СтрДлина(ТекстЯчейкиИНН) <> 12)  Тогда
				СписокОшибок.Добавить("Проверьте ИНН " + НомерСтроки)
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Изменяем статус этапа проверки исходя из наличия или отсутсвия ошибок
	Если СписокОшибок.Количество() <> 0 Тогда
		МенеджерЗаписи.Статус = Перечисления.ADR_EXT_СатусыЭтаповПроверки.НеПройден;
		ХранилищеОшибок = Новый ХранилищеЗначения(СписокОшибок);
		МенеджерЗаписи.СообщениеОРезультате = ХранилищеОшибок;
		МенеджерЗаписи.Записать();
	Иначе
		МенеджерЗаписи.Статус = Перечисления.ADR_EXT_СатусыЭтаповПроверки.Пройден;
		МенеджерЗаписи.СообщениеОРезультате = "Ошибок нет!";
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецФункции
